___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>

In this assignment you will start off with Numpy Exercises and then complete the whole Exercise with Pandas questions. All the subjects related to questions here already covered in preclass materials and in-class sessions. So good luck!

D1622-AkÄ±n

#### 1. Import NumPy Library

In [364]:
import numpy as np

#### 2. Create an array from my_list=[5,10,15,20,25]

In [365]:
my_list=[5,10,15,20,25]
np.array(my_list)

array([ 5, 10, 15, 20, 25])

#### 3. Generate an array 5x5 zeros

In [366]:
np.zeros((5,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

#### 4. Generate an array 4x4 ones assign data type int

In [367]:
np.ones((4,4),dtype=int)

array([[1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1]])

#### 5. Make all the values of the array above 7

In [368]:
np.ones((4,4),dtype=int)*7

array([[7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7]])

#### 6. Create same array above with full method

In [369]:
np.full((4,4),7)

array([[7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7]])

#### 7. Create an array of even integers from 2 to 16

In [370]:
np.arange(2,17,2)

array([ 2,  4,  6,  8, 10, 12, 14, 16])

#### 8. Create a 5x5 matrix with values between 0 to 25

In [371]:
np.arange(0,25).reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

#### 9. Create a 5x5 matrix with values between 0 to 25 using linspace

In [372]:
np.linspace(0, 24,25).reshape(5,5)

array([[ 0.,  1.,  2.,  3.,  4.],
       [ 5.,  6.,  7.,  8.,  9.],
       [10., 11., 12., 13., 14.],
       [15., 16., 17., 18., 19.],
       [20., 21., 22., 23., 24.]])

#### 10. Create 5 random number with numpy

In [373]:
np.random.rand(5)

array([0.19611663, 0.03034081, 0.05237153, 0.45980348, 0.47031398])

#### 11. Create random normal distributed 5x5 array

In [374]:
np.random.randn(5,5)

array([[ 0.56195244, -1.16853875, -1.08191811, -0.36869176, -0.56627   ],
       [-2.29809549,  2.49624768,  0.70411394, -0.27454605,  0.5471919 ],
       [-1.43061579,  1.09779624,  1.22385325,  0.96570329,  1.63161286],
       [-1.33690671, -0.76701022,  0.22241073, -0.31986665, -0.7703658 ],
       [ 0.43450696, -0.48027922,  0.53997153, -0.96307777, -0.92047728]])

#### 12. Create 3x4 shaped array with random int numbers between 20 and 50 with numpy

In [375]:
np.random.randint(20,50,size=(3,4))

array([[43, 41, 20, 25],
       [47, 28, 37, 40],
       [25, 31, 43, 30]])

#### 13. Reshape the array below with shape 6x8

In [377]:
ranarr=np.random.randint(0,60,48)
ranarr

array([41, 59, 34, 10, 25, 44, 30, 22,  5, 54, 24, 16, 58, 10, 19, 24, 51,
       13, 48, 16,  4, 51,  5, 37, 14, 46,  5, 52, 10, 50, 29,  4, 40, 51,
        2, 45, 41, 19, 34,  0, 35, 12, 29, 48,  7, 44, 22, 23])

In [378]:
ranarr.reshape(6,8)

array([[41, 59, 34, 10, 25, 44, 30, 22],
       [ 5, 54, 24, 16, 58, 10, 19, 24],
       [51, 13, 48, 16,  4, 51,  5, 37],
       [14, 46,  5, 52, 10, 50, 29,  4],
       [40, 51,  2, 45, 41, 19, 34,  0],
       [35, 12, 29, 48,  7, 44, 22, 23]])

In [379]:
#reshape with -1
ranarr.reshape(-1,8)

array([[41, 59, 34, 10, 25, 44, 30, 22],
       [ 5, 54, 24, 16, 58, 10, 19, 24],
       [51, 13, 48, 16,  4, 51,  5, 37],
       [14, 46,  5, 52, 10, 50, 29,  4],
       [40, 51,  2, 45, 41, 19, 34,  0],
       [35, 12, 29, 48,  7, 44, 22, 23]])

## Numpy Indexing and Selection

In [380]:
#Create array below
mat=np.arange(1,17).reshape(4,4)
mat

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

#### 14. Write code that reproduces the output shown below.<br>

In [381]:
#array([[ 6,  7],[10, 11]])
mat[1:3,1:3]

array([[ 6,  7],
       [10, 11]])

#### 15. Get the first column of the array.

In [382]:
mat[:,0]

array([ 1,  5,  9, 13])

#### 16. Get the values in 2nd row for every 2 step.

In [383]:
mat[1,::2]

array([5, 7])

#### 17.Assign 77 to every cell in 3rd column.

In [384]:
mat[:,2]=77
mat

array([[ 1,  2, 77,  4],
       [ 5,  6, 77,  8],
       [ 9, 10, 77, 12],
       [13, 14, 77, 16]])

#### 18. Take 2nd row 1st column, 4th row 2nd column.

In [385]:
mat[(1,3),(0,1)]

array([ 5, 14])

#### 19. Take between 2nd and last row with step 2 and between 1 and last column with step 2.

In [386]:
mat[1::2,0::2]

array([[ 5, 77],
       [13, 77]])

## NumPy Operations

#### 20. Get the sum of values smaller than 10 and values bigger than 12 from array above

In [387]:
mat

array([[ 1,  2, 77,  4],
       [ 5,  6, 77,  8],
       [ 9, 10, 77, 12],
       [13, 14, 77, 16]])

In [388]:
mat[mat<10]

array([1, 2, 4, 5, 6, 8, 9])

In [389]:
mat[mat>12]

array([77, 77, 77, 13, 14, 77, 16])

In [390]:
mat[mat<10]+mat[mat>12]

array([78, 79, 81, 18, 20, 85, 25])

#### 21. Get the standard deviation of the result above

In [391]:
np.std(mat[mat<10]+mat[mat>12])

29.700546274093877

#### 22. Get the sum of second column from array above

In [392]:
#print array here
mat[:,2]=[3,7,11,15]

In [393]:
np.sum(mat[:,1],axis=0)

32

#### 23. Get the median,mean and std of 3rd row from array above

In [394]:
mat

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [395]:
mat[2]

array([ 9, 10, 11, 12])

In [396]:
#median
np.median(mat[2])

10.5

In [397]:
#mean
np.mean(mat[2])

10.5

In [398]:
#std
np.std(mat[2])

1.118033988749895

# Pandas Section

In [399]:
import pandas as pd

**Read Salaries.csv take a look at first 5 rows, df info and df statistical measurements**

In [400]:
sal=pd.read_csv('Salaries.csv')

In [401]:
sal.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [402]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [403]:
sal.describe()

                  Id        BasePay  ...  Notes  Status
count  148654.000000  148045.000000  ...    0.0     0.0
mean    74327.500000   66325.448841  ...    NaN     NaN
std     42912.857795   42764.635495  ...    NaN     NaN
min         1.000000    -166.010000  ...    NaN     NaN
25%     37164.250000   33588.200000  ...    NaN     NaN
50%     74327.500000   65007.450000  ...    NaN     NaN
75%    111490.750000   94691.050000  ...    NaN     NaN
max    148654.000000  319275.010000  ...    NaN     NaN

[8 rows x 10 columns]

**How many different year value are there**

In [404]:
sal.Year.value_counts()

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

**Print out max and avg Totalpay**

In [405]:
#max
sal.TotalPay.max()

567595.43

In [406]:
#avg
sal.TotalPay.mean()

74768.321971703

**How many records are there which have TotalPay bigger than avg TotalPay**

In [407]:
len(sal.TotalPay[sal.TotalPay>sal.TotalPay.mean()])

69489

**How much does ALBERT PARDINI make (including benefits)?**

In [408]:
sal.TotalPayBenefits[sal["EmployeeName"]=="ALBERT PARDINI"]

2    335279.91
Name: TotalPayBenefits, dtype: float64

**Who is lowest paid person**

In [409]:
sal[sal.TotalPayBenefits==sal.TotalPayBenefits.min()]["EmployeeName"]

148653    Joe Lopez
Name: EmployeeName, dtype: object

**What are the unique Jobs in dataset?**

In [410]:
sal.JobTitle.unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

**List 3 least common Jobs**

In [411]:
sal.JobTitle.value_counts().tail(3)

ASSISTANT TO THE DIRECTOR, PUBLIC AFFAIRS       RS    1
Forensic Toxicologist Supervis                        1
RENT BOARD SUPERVISOR                                 1
Name: JobTitle, dtype: int64

**How many people earned more than avg in 2012**

In [412]:
sal[(sal.TotalPayBenefits>sal.TotalPayBenefits.mean())&(sal.Year==2012)]["EmployeeName"].count()

20366

**How many people have the word Manager in their job title?**

In [413]:
#sum(sal["JobTitle"].apply(lambda x:"manager" in x.lower()))

def manager_func(x):
  if "manager" in x.lower():
    return True
  else:
    return False

In [414]:
len(sal[sal.JobTitle.apply(lambda x:manager_func(x))])

4110

**Take Id,EmployeeName,JobTitle,TotalPay and TotalPayBenefits columns with iloc and assign it as sal_new dataframe**

In [415]:
sal.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [416]:
sal_new=sal.iloc[:,[0,1,2,7,8]]
sal_new

            Id       EmployeeName  ...   TotalPay  TotalPayBenefits
0            1     NATHANIEL FORD  ...  567595.43         567595.43
1            2       GARY JIMENEZ  ...  538909.28         538909.28
2            3     ALBERT PARDINI  ...  335279.91         335279.91
3            4  CHRISTOPHER CHONG  ...  332343.61         332343.61
4            5    PATRICK GARDNER  ...  326373.19         326373.19
...        ...                ...  ...        ...               ...
148649  148650      Roy I Tillery  ...       0.00              0.00
148650  148651       Not provided  ...       0.00              0.00
148651  148652       Not provided  ...       0.00              0.00
148652  148653       Not provided  ...       0.00              0.00
148653  148654          Joe Lopez  ...    -618.13           -618.13

[148654 rows x 5 columns]

**Take columns betweeen EmployeeName and TotalPayBenefits with loc and assign it o sal_new df**

In [417]:
sal_new=sal_new.loc[:,"EmployeeName":"TotalPayBenefits"]
sal_new

             EmployeeName  ... TotalPayBenefits
0          NATHANIEL FORD  ...        567595.43
1            GARY JIMENEZ  ...        538909.28
2          ALBERT PARDINI  ...        335279.91
3       CHRISTOPHER CHONG  ...        332343.61
4         PATRICK GARDNER  ...        326373.19
...                   ...  ...              ...
148649      Roy I Tillery  ...             0.00
148650       Not provided  ...             0.00
148651       Not provided  ...             0.00
148652       Not provided  ...             0.00
148653          Joe Lopez  ...          -618.13

[148654 rows x 4 columns]

**Print out the names of the employees who earn more than min, but less than avg**

In [418]:
sal[(sal.TotalPayBenefits>sal.TotalPayBenefits.min()) &(sal.TotalPayBenefits<sal.TotalPayBenefits.mean())]["EmployeeName"]

10806            KWE LEE
10807     MIGUEL CARO JR
10808      JOANNE MORRIS
10809      LAYLA WELBORN
10810            LE BANH
               ...
148648       Leon Walker
148649     Roy I Tillery
148650      Not provided
148651      Not provided
148652      Not provided
Name: EmployeeName, Length: 75649, dtype: object